<template>
  <div>
    <div :style="{ display: AllPageDisplay}">
      <div class="backround-app-site">
        <div class="all_padding">
          <div class="header_navigation">
            <ul class="list_header">
              <li>
                <img src="logo.svg" alt="logo" class="logo">
              </li>
              <li>
                <button @click="lawsScroll()" class="header-txt">Законы</button>
              </li>
              <li>
                <button @click="theoryScroll()" class="header-txt">Теория</button>
              </li>
              <li>
                <button @click="laboratoryScroll()" class="header-txt-on">Лабораторные работы</button>
              </li>
            </ul>
            <div>
              <ul class="list">
                <li class="animation_navigation">
                  <p class="header_txt_two">С нами Физика станет <span style="color: #FFF500;">доступнее, проще, понятнее</span></p>
                </li>
                <li>
                  <img class="animation_cube" src="4dIu.gif" alt="animation_cube">
                </li>
              </ul>
            </div>
          </div>
        </div>
      </div>
      <div class="all_padding">
        <div class="container">
          <p class="cont_txt">Выполнили студенты</p>
          <table>
            <tr>
              <td>
                <div class="student_one_rectangle">
                  <table>
                    <tr>
                      <td>
                        <img class="student_img" src="unnamedone.png">
                      </td>
                    </tr>
                    <tr>
                      <td>
                        <p class="name_person">Саакян Михаил Группа: 117ИС</p>
                        <p class="work_person">Специальность: Информационные системы</p>
                      </td>
                    </tr>
                  </table>
                </div>
              </td>
              <td class="navigation_person_rectangle">
                <div class="student_two_rectangle">
                  <table>
                    <tr>
                      <td>
                        <img class="student_img" src="unnamedtwo.png">
                      </td>
                    </tr>
                    <tr>
                      <td>
                        <p class="name_person">Тян Артур Группа: 117ИС</p>
                        <p class="work_person">Специальность: Информационные системы</p>
                      </td>
                    </tr>
                  </table>
                </div>
              </td>
              <td>
                <div class="student_three_rectangle">
                  <table>
                    <tr>
                      <td>
                        <img class="student_img" src="unnamedthree.png">
                      </td>
                    </tr>
                    <tr>
                      <td>
                        <p class="name_person_three">Зверев Александр Группа: 117ИС</p>
                        <p class="work_person">Специальность: Информационные системы</p>
                      </td>
                    </tr>
                  </table>
                </div>
              </td>
            </tr>
          </table>
        </div>
      </div>
      <div class="all_padding_two">
        <div class="container_two">
          <p class="cont_two_txt">Законы</p>
          <div class="laws">
            <div class="navigation_laws_one">
              <div class="laws_rectangle">
                <ul class="laws_list">
                  <li>
                    <p class="laws_name_txt">Третий закон Ньютона</p>
                  </li>
                  <li>
                    <div class="navigation_btn_laws">
                      <button v-if="LawsNUMone_display == 'none'" @click="ff()">
                        <div class="laws_btn">
                          <img class="arrow_img" src="aaarrow.png">
                        </div>
                      </button>
                      <button v-if="LawsNUMone_display == 'block'" @click="close()">
                        <div style="transform: rotate(180deg) " class="laws_btn">
                          <img class="arrow_img" src="aaarrow.png">
                        </div>
                      </button>
                    </div>
                  </li>
                </ul>
              </div>
              <div :style="{ display: LawsNUMone_display}">
                <div class="navigation_laws_txt_vueblock">
                  <div class="laws_txt_vueblock">
                    <p class="lawstxt">Тела действуют друг на друга с силами равными по модулю и противоположными по направению</p>
                    <p class="lawstxt_two">F₁ = -F₂</p>
                  </div>
                </div>
              </div>
            </div>
            <div class="navigation_laws_two">
              <div class="laws_rectangle">
                <ul class="laws_list">
                  <li>
                    <p class="laws_name_txt">Правило Ленца</p>
                  </li>
                  <li>
                    <div class="navigation_btn_laws">
                      <button v-if="LawsNUMtwo_display == 'none'" @click="cc()">
                        <div class="laws_btn">
                          <img class="arrow_img" src="aaarrow.png">
                        </div>
                      </button>
                      <button v-if="LawsNUMtwo_display == 'block'" @click="close()">
                        <div style="transform: rotate(180deg) " class="laws_btn">
                          <img class="arrow_img" src="aaarrow.png">
                        </div>
                      </button>
                    </div>
                  </li>
                </ul>
              </div>
              <div :style="{ display: LawsNUMtwo_display}">
                <div class="navigation_laws_txt_vueblock">
                  <div class="laws_txt_vueblock">
                    <p class="lawstxt">Индукционный ток направлен так, чтобы своим магнитным полем противодействовать тому изменению магнитного потока,которым он вызван</p>
                  </div>
                </div>
              </div>
            </div>
            <div>
              <div class="laws_rectangle">
                <ul class="laws_list">
                  <li>
                    <p class="laws_name_txt">Магнитная индукция</p>
                  </li>
                  <li>
                    <div class="navigation_btn_laws">
                      <button v-if="LawsNUMthree_display == 'none'" @click="dd()">
                        <div class="laws_btn">
                          <img class="arrow_img" src="aaarrow.png">
                        </div>
                      </button>
                      <button v-if="LawsNUMthree_display == 'block'" @click="close()">
                        <div style="transform: rotate(180deg) " class="laws_btn">
                          <img class="arrow_img" src="aaarrow.png">
                        </div>
                      </button>
                    </div>
                  </li>
                </ul>
              </div>
              <div :style="{ display: LawsNUMthree_display}">
                <div class="navigation_laws_txt_vueblock">
                  <div class="laws_txt_vueblock">
                    <p class="lawstxt">Магнитная индукция - силоавя характеристика магнитного поля</p>
                    <p class="lawstxt_two">B = F/i * l</p>
                  </div>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
      <div class="all_padding_two">
        <p class="theory_txt">Теория</p>
        <table>
          <tr class="navigation_theory_two">
            <td class="navigation_theory">
              <button @click="OneTheory(),top()" class="theory_rectangle">
                <p class="theoty_txt_two">Применение и практическое значение закона Джоуля – Ленца</p>
              </button>
            </td>
            <td>
              <button @click="TwoTheory(),top()" class="theory_rectangle_two">
                <p class="theoty_txt_two">Источник тока, характеристики источника тока (ЭДС)</p>
              </button>
            </td>
          </tr>
          <tr>
            <td class="navigation_theory">
              <button @click="ThreeTheory(),top()" class="theory_rectangle_three">
                <p class="theoty_txt_two">Как устроена античастица, история откртия античастиц</p>
              </button>
            </td>
            <td>
              <button @click="FourTheory(),top()" class="theory_rectangle_four">
                <p class="theoty_txt_two">Из чего состоит тёмная материя, поиски Антона Баушева</p>
              </button>
            </td>
          </tr>
        </table>
      </div>
      <div class="all_padding_two">
        <div class="navigation_laboratory">
          <p class="laboratory_txt">Лабораторные работы</p>
          <div class="navigation_rectangle_laboratory">
            <div @click="Laboratory(),top()">
              <div class="laboratory_rectangle">
                <div class="navigation_all_txt_laboratory_rectangle">
                  <p class="laboratory_name">Изменение ЭДС и внутреннего сопростивления источника тока</p>
                  <p class="laboratory_target_name">
                    <span style="color: #FFF500;">Цель работы:</span> измерить ЭДС и внутреннее сопротивление источника постоянного тока.
                  </p>
                </div>
              </div>   
            </div>
          </div> 
          <div class="laboratory_rectangle">
            <div class="navigation_all_txt_laboratory_rectangle">
              <p class="laboratory_name">Изучение устройства и работы трансформатора</p>
              <p class="laboratory_target_name">
                <span style="color: #FFF500;">Цель работы:</span> изучение устройства трансформа-
                тора и измерение его коэфф. трансформации.
              </p>
            </div>
          </div>
        </div>
      </div>
      <div class="navigation_footer">
        <div class="footer_rectangle">
          <ul class="footer_list">
            <li>
              <p class="footer_txt">Саакян Михаил:<a href="https://vk.com/nlemsaakyan"><span style="color: #2D9AFF;"> https://vk.com/nlemsaakyan</span></a></p>
              <div class="nav_txt_footer">
                <p class="footer_txt">Тян Артур:<a href="https://vk.com/furidashi1"><span style="color: #2D9AFF;"> https://vk.com/furidashi1</span></a></p>
              </div>
              <p class="footer_txt">Зверев Александр:<a href="https://vk.com/s.zv2357"><span style="color: #2D9AFF;"> https://vk.com/s.zv2357</span></a></p>
            </li>
            <li class="navigation_github">
              <div>
                <a href="https://github.com/Exportqq">
                  <img class="github" src="github.svg">
                </a>
              </div>
            </li>
          </ul>
        </div>
      </div>
    </div>
    <div :style="{ display: OneTheoryDisplay}">
      <div class="all_padding">
        <div class="all_theory_navigation">
          <ul class="laws_list">
            <li>
              <div>
                <button @click="NoTheory(),top()">
                  <img class="all_theory_img" src="theotybtnimg.svg">
                </button>
              </div>
            </li>
            <li>
              <div>
                <p class="new_theory_txt">Применение и практическое значение закона Джоуля – Ленца</p>
              </div>
            </li>
          </ul>
        </div>
        <div>
          <p class="all_theory_txt">На примере многих бытовых приборов понятно, что если через участок цепи проходит электроток и при этом не совершается какая-либо работа, то происходит нагревание проводника. Иногда оно идет на пользу — например, в лампе накаливания или в аппарате дуговой сварки. Но в других случаях тепловой эффект нежелателен — например, перегрев электрической проводки в здании может вызвать пожар. Поэтому в наших интересах управлять таким эффектом, и правило Джоуля-Ленца определяет, от чего зависит тепловое действие тока. <br><br>Правило было сформулировано в результате опытов двух ученых — англичанина Джеймса Прескотта Джоуля и российского физика Эмилия Христиановича Ленца. Поскольку ученые работали независимо друг от друга, новый закон назвали двойным именем. <br><br>Применение на практике закона Джоуля-Ленца заключается в том, что тепловым действием электрического тока можно управлять, подбирая проводники с нужным сопротивлением. К примеру, для электрических нагревательных приборов, которые должны выделять максимум тепла, выбирают проводники с высоким сопротивлением. <br><br>Низкое сопротивление, напротив, позволяет проводнику практически не нагреваться при прохождении тока. Поэтому на промышленных предприятиях с усиленными требованиями к пожаробезопасности для прокладки линий электропередач используется медный кабель. Удельное сопротивление меди сечением 1 мм2 равно 0,0175 Ом, в то время как у алюминия оно составляет 0,0271 Ом. Медь практически не нагревается, чем снижает риск возгораний.</p>
        </div>
      </div>
    </div>
    <div :style="{ display: TwoTheoryDisplay}">
      <div class="all_padding">
        <div class="all_theory_navigation">
          <ul class="laws_list">
            <li>
              <div>
                <button @click="NoTheory(),top()">
                  <img class="all_theory_img" src="theotybtnimg.svg">
                </button>
              </div>
            </li>
            <li>
              <div>
                <p class="new_theory_txt">Источник тока (ЭДС)</p>
              </div>
            </li>
          </ul>
        </div>
        <div>
          <p class="all_theory_txt">В один дождливый субботний день мы хотели посмотреть телевизор. Но вот незадача: в пульте от телевизора села батарейка. Поставили новенькую алкалиновую батарейку с напряжением 1,5 В и стали выбирать программу. Переключали каналы туда-сюда, но в тот день ничего интересного не показывали. Чтобы немного себя развлечь, мы решили заняться физикой. И вот у нас возник вопрос: что происходит с батарейкой в процессе ее работы? <br><br>Для того чтобы поддерживать в проводнике ток длительное время, в замкнутой цепи должен быть участок, на котором будет происходить перенос зарядов против сил электростатического поля. Перемещение зарядов на этом участке возможно лишь с помощью сил неэлектростатического происхождения, называемых сторонними силами. <br><br>Действие сторонних сил характеризуется величиной, называемой электродвижущей силой (ЭДС).  <br><br>Источник тока — та часть электрической цепи, где действуют сторонние силы.  <br><br>Получается, что источником тока в пульте от телевизора является батарейка, или по-другому — гальванический элемент. У источника тока существует две основные характеристики: <br><br>   1. электродвижущая сила (ЭДС);<br>       2. внутреннее сопротивление. <br><br>ЭДС источника тока (ε) — это физический параметр, который характеризует работу (Аст), затраченную на перемещение зарядов (q) внутри источника сторонними силами. <br><br>Единица измерения ε — В (Вольт).<br><br>Другими словами, ЭДС — это максимальное напряжение.  <br><br>Решили мы измерить напряжение батарейки спустя время. К счастью, вольтметр дома у нас был (не спрашивайте, откуда). И он показал значение 1 В. Часть энергии да, как оказалось, потерялась. Но ЭДС батарейки как была, так и осталась 1,5 В.<br><br>Внутреннее сопротивление (r) определяет количество потерь энергии при прохождении тока через источник тока. <br><br>Учитывается в электрической цепи так же, как и сопротивление всех элементов цепи.<br>Единица измерения r — Ом.</p>
        </div>
      </div>
    </div>
    <div :style="{ display: ThreeTheoryDisplay}">
      <div class="all_padding">
        <div class="all_theory_navigation">
          <ul class="laws_list">
            <li>
              <div>
                <button @click="NoTheory(),top()">
                  <img class="all_theory_img" src="theotybtnimg.svg">
                </button>
              </div>
            </li>
            <li>
              <div>
                <p class="new_theory_txt">Как устроена античастица, история откртия античастиц</p>
              </div>
            </li>
          </ul>
        </div>
        <div>
          <p class="all_theory_txt"><span style="font-weight: 600;">Что такое античастицы</span>
            <br><br>Как правило, со школьной скамьи большинство людей под зарядом
            понимают только электрический заряд. Действительно, если рассматривать
            электрон и его античастицу — позитрон, то они различаются именно
            электрическим зарядом: у электрона электрический заряд отрицательный,
            а у позитрона — положительный. Однако, помимо электромагнитного,
            существуют также гравитационное, сильное и слабое взаимодействия,
            каждое из которых также обладает своими зарядами. Скажем, протон,
            имеющий положительный электрический заряд, и антипротон, имеющий
            отрицательный электрический заряд, в сильном взаимодействии
            приобретают барионный заряд (или барионное число), равный +1 для
            протона и -1 для антипротона. Поэтому в случае, если электрический заряд
            отсутствует, например, как у нейтрона и антинейтрона,
            сильновзаимодействующие частицы все равно различаются барионным
            числом, которое равно +1 для нейтрона и -1 для антинейтрона.
            Бывают ли ситуации, когда и барионный, и электрический заряды равны
            нулю? Да, например, в случае с мезонами. Они состоят из кварка
            и антикварка, и по определению их барионный заряд — ноль. Рассмотрим,
            например, электрически нейтральные К-мезоны — удивительные частицы,
            в которых было открыто нарушение комбинированной пространственной
            и зарядовой четности. Существуют К0-мезон и анти-К0-мезон. Электрический
            и барионный заряды обеих частиц равны нулю. Почему же они тогда
            считаются частицей и античастицей? В данном случае различается
            кварковый состав мезонов. К0-мезон состоит из анти-s-кварка и d-кварка.
            Анти-К0-мезон состоит, наоборот, из s-кварка и анти-d-кварка. Странный
            кварк — s — обладает новым квантовым числом или зарядом — странностью.
            Странность различна для s- и анти-s-кварков точно так же, как барионный
            заряд различается для протонов и антипротонов; d-кварки и d-антикварки
            имеют свое квантовое число, аналогичное странности. Эти заряды

            <br><br>позволяют различать между собой электрически и барионно-нейтральные
            К0- и анти-К0-мезоны.
            Однако бывает так, что частицы и античастицы тождественны. Например, φ-
            мезон, который состоит из анти-s-кварка и s-кварка, а его античастица,
            наоборот, из s-кварка и анти-s-кварка. Получается, что φ-мезон сам себе
            античастица. На самом деле частиц, подобных φ-мезону, существует
            множество. Самая известная из них, наверное, J/ψ — мезон, который состоит
            из очаровательного кварка и антикварка. Фотоны также тождественны себе.
            И переносчики слабого взаимодействия — Z0-бозоны — тоже. Но есть одна
            элементарная частица, для которой ответ на вопрос, тождественна ли она
            сама себе, не прояснен до сих пор. Эта частица — нейтрино. Она участвует
            только в слабом и гравитационном взаимодействиях. Впрочем,
            гравитационное взаимодействие при масштабах энергий, доступных
            в настоящее время, не играет никакой роли. Поэтому можно сказать, что
            нейтрино участвует только в слабых взаимодействиях. В квантовой теории
            поля для описания состояний нейтрино существуют два подхода. Первый —
            это так называемый дираковский подход, в рамках которого нейтрино
            и антинейтрино считаются нетождественными друг другу. Иными словами,
            с точки зрения теоретиков, нейтрино и антинейтрино похожи на электрон
            и позитрон. Второй — подход Майораны, в котором нейтрино
            и антинейтрино считаются тождественными друг другу. Выбор в пользу
            концепции Майораны может дать экспериментальное наблюдение двойного
            безнейтринного бета-распада ядер. Данный распад — один из самых сложных
            для экспериментального наблюдения. В настоящее время этот процесс все
            еще не обнаружен.
          
            <br><br><span style="font-weight: 600;">История открытия античастиц</span>
            <br><br>Уже в Древней Греции античные мыслители задались вопросом
            о фундаментальной структуре материи. По научной моде тех лет греки
            искали первоэлементы. В результате этих поисков у греков появилось
            несколько совершенно различных наборов первоэлементов и даже
            концепция атомов в качестве экстравагантного довеска. Но греки не могли
            сделать выбор между разными наборами, поскольку для выбора было
            недостаточно только логических аргументов, а до идеи постановки
            решающего эксперимента оставалось почти 2000 лет.
            Только на рубеже XVII–XVIII веков физика сформировалась как наука,
            основной движущей силой которой является эксперимент, и оставалась
            ею вплоть до первой четверти XX века. Именно неожиданные
            экспериментальные результаты послужили толчком к появлению

            <br><br>классической электродинамики, специальной теории относительности
            и квантовой механики.
            Однако в 1928 году все изменилось. Выдающийся английский физик-
            теоретик, один из создателей квантовой механики Поль Дирак написал
            релятивистское квантовое уравнение для частиц с полуцелым спином. Это
            уравнение обладало одной важной особенностью, которую Дирак в него
            не закладывал: если у этого уравнения существовало решение для частиц
            с отрицательным электрическим зарядом, то неминуемо появлялось
            дополнительное решение для частиц с положительным зарядом. В начале
            1930-х годов была известна всего одна частица с полуцелым спином
            и отрицательным зарядом — это был электрон — и одна частица с полуцелым
            спином и положительным зарядом, и это был протон. Поначалу физики
            думали, что два решения уравнения Дирака соответствуют именно этим двум
            частицам. Но очень скоро немецкий математик Герман Вейль доказал, что
            частицы из уравнения Дирака с положительными и отрицательными
            зарядами должны иметь одинаковые массы. И тут возникла проблема,
            поскольку протон примерно в 2000 раз тяжелее электрона.
            То есть теория Дирака предсказывала принципиально новый факт. Говоря
            современным языком, Поль Дирак предсказал античастицы. Только поначалу
            в них никто не поверил, а самого Дирака критиковали за якобы ошибочное
            уравнение. И зря. Ведь уже год, как античастицы были открыты. Только
            об этом не догадывался даже их первооткрыватель — талантливый советский
            физик-экспериментатор Дмитрий Владимирович Скобельцын. Дело в том,
            что он был увлечен актуальной для того времени проблемой: изучением
            состава космических лучей, то есть частиц, которые попадают на Землю
            из космоса. Чтобы измерить импульс частиц космических лучей и их заряд,
            Скобельцын поместил камеру Вильсона — новейший для 1930-х годов
            прибор, который регистрировал треки заряженных частиц, — в постоянное
            магнитное поле. В такой камере пришедшие из космоса положительно
            заряженные частицы должны закручиваться в одну сторону,
            а отрицательные — в другую. Скобельцын наблюдал несколько треков,
            похожих на треки электронов, но закручивающихся в противоположную
            сторону. С высоты современного знания мы понимаем, что такие треки
            оставляли позитроны. Но ученый предположил, что эти треки оставляют
            электроны, которые летят с поверхности Земли, где образуются в результате
            естественной радиоактивности, и перестал интересоваться данными
            треками.
            Поэтому первооткрывателем позитронов во всем мире считается Карл
            Андерсон. Этот блестящий американский экспериментатор знал о теории

            <br><br>Дирака и захотел экспериментально проверить существование «электронов
            с другим зарядом». Андерсон использовал методику Скобельцына
            с небольшим дополнением, которое сделало американского
            экспериментатора Нобелевским лауреатом: он поместил в камеру Вильсона
            свинцовую пластину. Заряженная частица, попадая в пластину, теряет часть
            своей энергии, ее импульс уменьшается, кривизна трека в магнитном поле
            меняется. Поэтому по изменению кривизны трека можно понять, с какой
            стороны от свинцовой пластины в камеру влетела частица. Это была
            та информация, которой не имел Скобельцын, чтобы открыть позитрон.
            Оказалось, что частицы, треки которых похожи на треки электронов,
            но закручены в другую сторону, летят из космоса так же, как и обычные
            электроны. Андерсон поставил свой эксперимент в 1932 году. Этот год
            считается годом открытия античастиц и годом, начиная с которого теория
            в физике частиц начала опережать эксперимент. Нейтрино, бозон Хиггса,
            топ-кварк сначала были предсказаны теоретиками. Порой эксперименты
            подтверждали теорию спустя полвека, как это было, например, с бозоном
            Хиггса.
            Можно сказать, что на новом уровне мы вернулись к ситуации, которая была
            в Древней Греции: теоретики предлагают множество новых
            фундаментальных концепций, как когда-то греки предлагали различные
            наборы первоэлементов. Только теперь экспериментаторы пытаются
            проверять эти концепции, если есть подобная технологическая возможность.
            А что с антипротоном? Это вторая античастица, которая была открыта
            физиками. Ее обнаружила в 1955 году на протонном ускорителе группа
            талантливого итальянского физика Эмилио Сегре, бежавшего от нацистов
            в Америку. Открытие было удостоено Нобелевской премии за 1959 год. Почти
            одновременно с антипротоном был открыт антинейтрон.
            В настоящее время обнаружены сотни античастиц. Любая заряженная
            частица, необязательно с полуцелым спином, имеет свою античастицу.
            За открытие античастиц больше не вручают Нобелевские премии.
            А обнаруженное еще Андерсоном свойство частицы и античастицы при
            взаимодействии превращаться в фотоны — аннигилировать — породило
            одну из фундаментальных загадок современной физики — барионную
            асимметрию Вселенной. Уравнение Дирака давно признано всеми физиками
            и легло в основание квантовой теории поля.
            <br><br><span style="font-weight: 600;">От античастиц к антиматерии</span>

            <br><br>Eсли еще в 1960-е годы физики могли получать позитроны, антипротоны
            и антинейтроны, то, казалось бы, отсюда один шаг до синтеза антиматерии,
            например антиводорода. Однако на этом пути встают большие трудности.
            Чтобы создать атомы и молекулы антиматерии, мало получить их составные
            кирпичики — античастицы. Эти античастицы нужно замедлить. Но, главное,
            антиматерию нужно хранить в мире, который состоит из материи.
            Античастицы нельзя просто положить в коробку: они проаннигилируют
            со стенками коробки. Если мы хотим сохранить античастицы, то надо хранить
            их в вакууме и в «сосуде без стенок». Для заряженных частиц в качестве
            подобного сосуда может использоваться сильное неоднородное магнитное
            поле. Задача удержания нейтральных частиц куда более сложная,
            но со временем она тоже была решена при помощи магнитного поля.
            В настоящее время антиводород удерживается в магнитных ловушках
            Пеннинга почти 20 минут.
            Синтез антиматерии логично начать с синтеза антиядер. Однако
            на сегодняшний день в этом направлении не удалось достигнуть большого
            прогресса. Синтезированы лишь антигелий-3, который состоит из двух
            антипротонов и одного антинейтрона, и антигелий-4, в состав которого
            входят два антипротона и два антинейтрона. (Заметим, что антигелий-3 был
            синтезирован в подмосковном Институте физики высоких энергий
            на ускорителе У-70, который в настоящее время является самым
            высокоэнергичным ускорителем частиц на территории России.)
            Еще меньший прогресс достигнут при синтезе антиатомов. В настоящее
            время синтезированы только атомы антиводорода. Единичные атомы
            антиводорода были синтезированы в Европейском центре физики частиц
            (ЦЕРН) только в 1995 году. Настоящий прорыв произошел в 2002 году, когда
            было синтезировано около 50 миллионов атомов антиводорода. С тех пор
            ЦЕРН является мировым лидером в области изучения физических
            и химических свойств антиматерии.
            <br><br><span style="font-weight: 600;">Античастицы и фундаментальные законы природы</span>
            <br><br>В современной физике симметрии играют исключительную роль.
            В квантовой теории поля одной из самых важных симметрий является так
            называемая СРТ-симметрия, то есть симметрия относительно
            одновременной замены всех зарядов на противоположные ©, зеркального
            отражения пространства (Р) и обращения вспять хода времени (Т). Считается,
            что в природе могут реализовываться только СРТ-симметричные теории.
            Из СРТ-симметрии следует множество свойств, которым должны подчиняться

            <br><br>частицы и античастицы, — например, равенство масс обеих. В настоящее
            время интересно, как ведут себя не столько отдельные античастицы, сколько
            более сложные антиобъекты, такие как ядра и атомы. Например, в ЦЕРН
            активно исследуют спектроскопические свойства атомов антиводорода. СРТ-
            симметрия требует, чтобы эти свойства были точно такими же, как и у атома
            водорода. А еще атом антиводорода должен падать в гравитационном поле
            Земли точно так же, как атом водорода. И такой эксперимент сейчас
            проводится в ЦЕРН. Так что ЦЕРН — это не только Большой адронный
            коллайдер и бозон Хиггса. Это в том числе проверка фундаментальных
            симметрий природы. Для понимания окружающего мира эти симметрии даже
            важнее, чем бозон Хиггса. Пока эксперименты не смогли найти ни одного
            признака нарушения СРТ-симметрии.
            Теперь оглянемся вокруг и зададимся еще одним естественным вопросом:
            почему нас окружает только материя? И куда из нашего мира исчезла
            антиматерия? Эта проблема получила название барионной асимметрии
            Вселенной. Из СРТ-теоремы наивно ожидать, что после Большого взрыва
            материи и антиматерии было равное количество. А значит, рано или поздно
            может произойти глобальная аннигиляция. И по безжизненной Вселенной
            будут метаться лишь почти не взаимодействующие одинокие фотоны.
            Загадка барионной асимметрии пока не разгадана. Тут можно предложить
            несколько ответов. Например, из материи состоит наша Солнечная система,
            а другая звездная система, расположенная далеко от нашей, состоит
            из антиматерии. Но тогда непонятно, по каким причинам вместо
            аннигиляции материя и антиматерия предпочли разделиться
            в пространстве? Да и звездных антимиров астрономы не наблюдают.
            Еще одну идею в 1967 году предложил советский академик, лауреат
            Нобелевской премии мира Андрей Дмитриевич Сахаров. Он предположил,
            что барионное число — то самое, о котором мы говорили в начале этой
            статьи, — нарушается, и дополнительно привлек экспериментальный факт
            нарушения комбинированной зарядовой © и пространственной (Р) четности.
            Тогда нестабильные частицы могут распадаться несколько иначе, чем
            нестабильные античастицы. И этого оказывается достаточно, чтобы в конце
            концов материи стало немного больше, чем антиматерии. Остальная материя
            и антиматерия проаннигилировали. А из небольшого избытка материи
            состоят все объекты во Вселенной. В настоящее время теория Сахарова
            дополнена и развита. Но основная идея осталась неизменной.
            <br><br><span style="font-weight: 600;">На антиматерии к звездам</span>

            <br><br>Не будет преувеличением сказать, что человечество мечтает полететь
            к звездам. Но даже до ближайшей звезды, Проксимы Центавра, свет
            от Солнца идет более трех лет. До остальных звезд гораздо дальше. Фантасты
            легко преодолевают столь гигантские расстояния при помощи
            пространственно-временных туннелей, гипердвигателей, десятого
            измерения и прочих удобных, но, увы, всего лишь воображаемых способов
            передвижения. В реальном мире космолетам первых звездопроходцев
            придется двигаться в одном пространстве со светом и желательно
            со скоростью, близкой к скорости света. При этом мы хотим, чтобы такой
            космолет имел наименьшую возможную массу. В этой ситуации лучшего
            топлива, чем антиматерия, для космолета не найти. Действительно, вся
            масса топлива при аннигиляции переходит в фотоны, которые вылетают
            из сопла со скоростью света. Фотоны должны разогнать космолет до очень
            больших скоростей, которые составляют доли скорости света. А значит,
            полет до Проксимы Центавра может составить, скажем, тридцать лет. Это
            много, но звездопроходцы успеют вернуться на Землю в течение жизни
            одного поколения. Что дальше? Можно как в фантастике 1950–1960-х годов:
            космолетчики, почти нестареющие из-за парадокса близнецов, и девушки,
            которые ждут их на Земле в криогенных камерах. Космическая романтика
            золотых шестидесятых или суровые будни две тысячи пятидесятых? А ведь
            все началось с необычного уравнения Дирака, которое неизбежно должно
            было иметь два решения, и Карла Андерсона, который догадался вставить
            в камеру Вильсона свинцовую пластину.</p>
        </div>
      </div>
    </div>
    <div :style="{ display: FourTheoryDisplay}">
      <div class="all_padding">
        <div class="all_theory_navigation">
          <ul class="laws_list">
            <li>
              <div>
                <button @click="NoTheory(),top()">
                  <img class="all_theory_img" src="theotybtnimg.svg">
                </button>
              </div>
            </li>
            <li>
              <div>
                <p class="new_theory_txt">Из чего состоит тёмная материя, поиски Антона Баушева</p>
              </div>
            </li>
          </ul>
        </div>
        <div>
          <p class="all_theory_txt"><span style="font-weight: 600;">Физик Антон Баушев о поисках темной материи, из чего она может состоять и о том, какие теории уже отброшены</span>
            <br><br>Точно сказать, из чего состоит темная материя, мы пока не можем. Но мы можем сказать, из чего
            она точно не состоит. Например, ее главным компонентом точно не являются все те частицы,
            которые нам уже известны. Также она не может состоять из тех черных дыр, которые образуются
            в результате эволюции звезд. Но при этом существуют теории, согласно которым темная материя
            может состоять из маленьких (или даже не очень маленьких) черных дыр, образовавшихся в
            ранней Вселенной, однако сейчас все же более популярна точка зрения, что темная материя —
            это какие-то неизвестные науке элементарные частицы.

            <br><br>До недавнего времени (скажем, в 2012 году) самой популярной частицей такого рода был вимп
            (WIMP, Weakly Interacting Massive Particle) — гипотетическая массивная частица, вступающая в
            обычное слабое взаимодействие. Однако долгие безуспешные поиски вимпа привели к тому, что
            интервал параметров, в котором он мог бы существовать, не противореча тем или иным
            экспериментальным данным, существенно сузился. В частности, были экспериментально
            опровергнуты многие модели легких вимпов. Однако отбросить вимп мы пока не можем, еще
            есть области параметров, которые не закрыты, где вимп вполне может существовать. Позволю
            себе сделать осторожный прогноз: эти области относительно легкодоступны, и в ближайшие
            10–20 лет они либо будут окончательно закрыты наблюдениями, либо вимп все-таки будет
            открыт.

            <br><br>Неудачи с поиском вимпа привели к тому, что научное сообщество сейчас находится в некотором
            смятении, поэтому предпочтения довольно субъективны: кому-то нравится идея, что темная
            материя состоит из аксионов, кому-то — что из стерильных нейтрино, кому-то нравится что-то
            еще. На деле это может оказаться что-то совсем нам неведомое. Разговор о значимых кандидатах
            можно вести на основании каких-то фактов, полученных на основе наблюдений, а таких фактов
            нет. Есть много теорий, которые одинаково хорошо описывают темную материю, но все они очень
            различны, и аргументированно выбрать самую оптимальную из них в настоящее время нельзя. В
            итоге может получиться так, что кто-то угадает ответ, а кому-то не повезет.

            <br><br>Например, в конце 70-х годов, когда темную материю только открыли, и немного позже, в начале
            1980-х, полагали, что она состоит из обычных нейтрино. Дело в том, что, помимо реликтового
            излучения, состоящего из фотонов, должно быть и реликтовое излучение, состоящее из нейтрино.
            Важное отличие состоит в том, что, в отличие от фотонов, нейтрино имеют массу. Поэтому энергия
            фотона может уменьшаться вплоть до нуля, и он всегда движется со скоростью света. Энергия
            нейтрино может уменьшаться только до массы покоя, а вот скорость может падать, и сейчас
            реликтовые нейтрино движутся сравнительно медленно, а поэтому, на первый взгляд, могли бы
            составлять темную материю. Однако, во-первых, с начала 1980-х верхний предел на массу
            нейтрино заметно улучшился, и поэтому выяснилось, что суммарной массы реликтовых нейтрино
            не хватает для объяснения всей скрытой массы. А во-вторых, скорости реликтовых нейтрино к
            моменту формирования галактик, например, были гораздо меньше скорости света, но все-таки
            очень велики (такая темная материя называется горячей). Поэтому формирование структур во
            Вселенной, где скрытая масса состоит из реликтовых нейтрино, протекало бы совершенно не так,
            как в нашей, и противоречит астрономическим наблюдениям. Таким образом, темная материя не
            может быть горячей и, в частности, состоять из реликтовых нейтрино.

            <br><br>Эксперименты по поиску темной материи сейчас идут буквально непрерывно. Например,
            установки прямого детектирования выключают только на модернизацию и техобслуживание, а в
            остальное время они работают и набирают статистику. Поиски следов аннигиляции темной
            материи тоже проходят постоянно, причем эти наблюдения, как правило, собирают информацию
            не только о темной материи, но и о других астрономических объектах. Например, в космосе
            летает гамма-телескоп и регистрирует все фотоны, которые ему встречаются. Его результаты
            можно использовать для изучения астрофизических источников космического излучения:
            пульсаров, квазаров… Но можно и искать в этих данных следы аннигиляции темной материи, и
            этим занимаются многие группы и в России, и в других странах. Но, к сожалению, пока никто
            ничего убедительного не нашел.
          </p>
        </div>
      </div>
    </div>
    <div :style="{ display: LabOne}">
      <div class="all_padding">
        <div class="all_theory_navigation">
          <div style="float: left;">
            <button @click="NoTheory(),top()">
              <img class="all_theory_img" src="theotybtnimg.svg">
            </button>
          </div>
          <div style="float: left;">
            <p class="new_theory_txt">Изменение ЭДС и внутреннего сопростивления источника тока</p>
          </div>
        </div>
        <ul class="lab_list">
          <li class="navigation_lab">
            <div>
              <ul class="laws_list">
                <li>
                  <div class="reostat">
                    <div class="polznav">
                      <div class="slidecontainer">
                        <input type="range" step="10" class="slider" v-model="myRange">
                        <p class="vallue_txt" id="demo"></p>
                        <p class="range_txt">{{ myRange }}</p>
                      </div>
                    </div>
                  </div>
                </li>
              </ul>
            </div>
          </li>
          <li>
            <div class="end_number_rectangle">
              <p class="end_number_txt">Параметры тока цепи</p>
              <div class="results_navigation">
                <p class="Ucalss">U = <span style="color: #3F49A3;">{{ U }} В</span></p>
                <p class="Ucalss">I = <span style="color: #3F49A3;">{{ I }} А</span></p>
              </div>
            </div>
          </li>
        </ul>
        <ul class="laws_list">
          <li class="navigation_lab_two">
            <div class="warring">
              <p class="warring_txt">Всё оборудование уже подключено. Меняйте значение на реостате, чтобы высчитать ЭДС при разных значений длины.</p>
            </div>
          </li>
          <li>
            <button onclick="window.location.href='backroundfizhub.png'" class="btn_AllOborud">
              Посмотреть всё оборудова-ние
            </button>
          </li>
        </ul>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  data() {
    return {
      AllPageDisplay: "block",
      OneTheoryDisplay: "none",
      TwoTheoryDisplay: "none",
      ThreeTheoryDisplay: "none",
      FourTheoryDisplay: "none",
      LabOne: "none",
      LawsNUMone_display: "none",
      LawsNUMtwo_display: "none",
      LawsNUMthree_display: "none",
      myRange: "",
      S: 0.5,
      p: 0.017,
      l: 10,
      E: 12,
      r: 0.20,
      R: 0,
      I: 0,
      U: 0,
    }
  },

  watch: {
    myRange(new_myRange) {
      if (new_myRange > -1) {
        this.R = this.p * this.myRange / this.S;
        this.I = this.E / (this.r + this.R);
        this.I = this.I.toFixed(2)
        this.U = this.I * this.R;
        this.U = this.U.toFixed(2)
      }
    }
  },
  methods: {
    ff() {
      this.LawsNUMone_display = "block"
      this.LawsNUMtwo_display = "none"
      this.LawsNUMthree_display = "none"
    },
    top() {
          window.scrollTo(0, 0);
    },
    lawsScroll() {
          window.scrollTo(0, 1600);
    },
    theoryScroll() {
          window.scrollTo(0, 2200);
    },
    laboratoryScroll() {
          window.scrollTo(0, 3000);
    },
    cc() {
      this.LawsNUMone_display = "none"
      this.LawsNUMtwo_display = "block"
      this.LawsNUMthree_display = "none"
    },
    dd() {
      this.LawsNUMthree_display = "block"
      this.LawsNUMone_display = "none"
      this.LawsNUMtwo_display = "none"
    },
    close() {
      this.LawsNUMthree_display = "none"
      this.LawsNUMone_display = "none"
      this.LawsNUMtwo_display = "none"
    },
    OneTheory() {
      this.OneTheoryDisplay = "block"
      this.AllPageDisplay = "none"
      this.TwoTheoryDisplay = "none"
      this.FourTheoryDisplay = "none"
    },
    TwoTheory() {
      this.OneTheoryDisplay = "none"
      this.AllPageDisplay = "none"
      this.TwoTheoryDisplay = "block"
      this.FourTheoryDisplay = "none"
    },
    ThreeTheory() {
      this.OneTheoryDisplay = "none"
      this.AllPageDisplay = "none"
      this.TwoTheoryDisplay = "none"
      this.ThreeTheoryDisplay = "block"
      this.FourTheoryDisplay = "none"
    },
    FourTheory() {
      this.OneTheoryDisplay = "none"
      this.AllPageDisplay = "none"
      this.TwoTheoryDisplay = "none"
      this.ThreeTheoryDisplay = "none"
      this.FourTheoryDisplay = "block"
    },
    NoTheory() {
      this.OneTheoryDisplay = "none"
      this.AllPageDisplay = "block"
      this.TwoTheoryDisplay = "none"
      this.LabOne = "none"
      this.ThreeTheoryDisplay = "none"
      this.FourTheoryDisplay = "none"
    },
    Laboratory() {
      this.LabOne = "block"
      this.AllPageDisplay = "none"
    }

  }
}
</script>

<style>
* {
  margin: 0px;
  padding: 0px;
}

.all_padding {
  padding: 0px 0px 0px 450px;
}

.all_padding_two {
  padding: 0px 0px 0px 450px;
}

.backround-app-site {
  background-image: url(static/backroundfizhub.png);
  width: 1920px;
  height: 883px;
}

.list_header li {
  float: left;
}

.list_header {
  height: 83px;
}

ul li {
  list-style: none;
}

.logo {
  padding: 0px 273px 0px 0px;
}

.list li {
  float: left;
}

.header-txt {
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 24px;
  line-height: 29px;
  color: #FFFFFF;
  padding: 25px 70px 0px 0px;
}

.header_txt_two {
  font-family: 'Montserrat';
  width: 653px;
  height: 234px;
  font-style: normal;
  font-weight: 700;
  font-size: 64px;
  line-height: 78px;
  color: #FFFFFF;
  padding: 143px 0px 0px 0px;
}

.header-txt-on {
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 24px;
  line-height: 29px;
  color: #FFFFFF;
  padding: 25px 70px 0px 0px;
}

.animation_navigation {
  padding: 0px 200px 0px 0px;
}

.animation_cube {
  border-radius: 500px;
  padding: 28px 0px 0px 0px;
}

.header_navigation {
  padding: 45px 0px 0px 0px;
}

/**/ 

.cont_txt {
  height: 230px;
  width: 795px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 48px;
  line-height: 59px;
  color: #3F49A3;
  padding: 97px 0px 0px 226px;
}

.student_one_rectangle {
  width: 310px;
  height: 500px;
  background: linear-gradient(21.44deg, #333399 0%, #0D92CB 98.49%);
  border-radius: 20px;
}

.student_two_rectangle {
  width: 310px;
  height: 500px;
  background: linear-gradient(21.44deg, #E98F0A 0%, #A44153 98.49%);  
  border-radius: 20px;
}

.student_three_rectangle {
  width: 310px;
  height: 500px;
  background: linear-gradient(21.44deg, #8F00FF 0%, #0500FF 98.49%);
  border-radius: 20px;
}

.navigation_person_rectangle {
  padding: 0px 45px 0px 45px;
}

.name_person {
  width: 256px;
  height: 58px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 24px;
  line-height: 29px;
  text-align: center;
  color: #FFFFFF;
  padding: 16px 0px 0px 54px;
}

.work_person {
  width: 277px;
  height: 87px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 24px;
  line-height: 29px;
  text-align: center;
  color: #FFFFFF;
  padding: 35px 0px 0px 34px;
}

.name_person_three {
  width: 277px;
  height: 58px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 24px;
  line-height: 29px;
  text-align: center;
  color: #FFFFFF;
  padding: 16px 0px 0px 32px;
}

.student_img {
  width: 245px;
  height: 245px;
  padding: 65px 0px 0px 65px;
}

/**/

.cont_two_txt {
  width: 197px;
  height: 209px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 48px;
  line-height: 59px;
  color: #3F49A3;
  padding: 150px 0px 0px 411px;
}

.laws_rectangle {
  width: 1020px;
  height: 96px;
  background: #393939;
  border-radius: 15px;
}

.laws_list li {
  float: left;
}

.laws_name_txt {
  width: 925px;
  height: 39px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 32px;
  line-height: 39px;
  color: #FFFFFF;
  padding: 28px 0px 0px 45px;
}

.laws_btn {
  width: 50px;
  height: 50px;
  background: #FFFFFF;
  border-radius: 10px;
}

.navigation_btn_laws {
  padding: 23px 0px 0px 0px;
}

.navigation_laws_one {
  padding: 70px 0px 0px 0px;
}

.navigation_laws_two {
  padding: 37px 0px 37px 0px;
}

/**/

.arrow_img {
  padding: 14px 0px 0px 0px;
}

.theory_txt {
  width: 188px;
  height: 59px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 48px;
  line-height: 59px;
  color: #3F49A3;
  padding: 150px 0px 95px 416px;
}

.theory_rectangle {
  background-image: url(static/Rectangle8.png);
  width: 485px;
  height: 161px;
}

.theory_rectangle_two {
  background-image: url(static/Rectangle.png);
  width: 500px;
  height: 161px;
}

.theory_rectangle_three {
  background-image: url(static/Rectangle10.png);
  width: 485px;
  height: 161px;
}

.theory_rectangle_four {
  background-image: url(static/Rectangle11.png);
  width: 500px;
  height: 161px;
}

.navigation_theory {
  padding: 0px 35px 0px 0px;
}

.navigation_theory_two {
  height: 231px;
}

.theoty_txt_two {
  width: 461px;
  height: 58px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 24px;
  line-height: 29px;
  text-align: center;
  vertical-align: middle;
  color: #393939;
  padding: 0px 0px 0px 23px;
}

/**/

.laboratory_rectangle {
  width: 1020px;
  height: 267px;
  background: #393939;
  border-radius: 20px;
}

.laboratory_txt {
  width: 807px;
  height: 59px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 48px;
  line-height: 59px;
  color: #3F49A3;
  padding: 0px 0px 0px 214px;
}

.navigation_laboratory {
  padding: 150px 0px 0px 0px;
}

.laboratory_name {
  height: 88px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 36px;
  line-height: 44px;
  color: #FFFFFF;
}

.laboratory_target_name {
  width: 1000px;
  height: 88px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 500;
  font-size: 36px;
  line-height: 44px;
  color: #FFFFFF;
  padding: 22px 0px 0px 0px;
}

.navigation_all_txt_laboratory_rectangle {
  padding: 35px 0px 0px 35px;
}

.navigation_rectangle_laboratory {
  padding: 70px 0px 40px 0px;
}

/**/

.footer_rectangle {
  width: 1920px;
  height: 394px;
  background: #393939;
}

.navigation_footer {
  padding: 165px 0px 0px 0px;
}


.footer_list li{
  float: left;
}

.footer_txt {
  height: 44px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 500;
  font-size: 36px;
  line-height: 44px;
  color: #8C8C8C;
}

a {
  text-decoration: none;
}

.navigation_github{
  padding: 0px 0px 0px 121px;
}

.footer_list {
  padding: 116px 0px 0px 450px;
}

/**/

.laws_txt_vueblock {
  width: 868px;
  height: 365px;
  background: #FFFFFF;
  border-width: 0px 5px 5px 5px;
  border-style: solid;
  border-color: #393939;
  border-radius: 0px 0px 12px 12px;
}

.navigation_laws_txt_vueblock {
  padding: 0px 0px 0px 76px;
}

.lawstxt {
  width: 821px;
  height: 237px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 32px;
  line-height: 39px;
  text-align: center;
  color: #3F49A3;
  padding: 85px 0px 0px 47px;
}

.lawstxt_two {
  width: 868px;
  height: 78px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 64px;
  line-height: 78px;
  text-align: center;
  color: #A33F8D;
}

/**/

.new_theory_txt {
  width: 920px;
  height: 100px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 40px;
  line-height: 49px;
  text-align: center;
  color: #393939;
}

.all_theory_txt {
  width: 1062px;
  padding: 0px 0px 100px 0px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 500;
  font-size: 40px;
  line-height: 49px;
  letter-spacing: -0.03em;
  color: #393939;
}

.all_theory_navigation {
  width: 1020px;
  padding: 65px 0px 200px 0px;
}

.slidecontainer {
    width: 100%; 
}


.slider {
    -webkit-appearance: none;  
    appearance: none;
    width: 480px;
    height: 6px; 
    outline: none; 
    opacity: 0.7; 
    -webkit-transition: .2s; 
    transition: opacity .2s;
}

.slider:hover {
    opacity: 1; 
}

.slider::-webkit-slider-thumb {
    -webkit-appearance: none; 
    appearance: none;
    border-radius: 12px;
    width: 30px; 
    height: 50px; 
    background: #3F49A3; 
    cursor: pointer; 
}

.slider::-moz-range-thumb {
    background: #3F49A3; 
    cursor: pointer; 
}

.reostat {
  background-image: url(static/reostat.png);
  width: 523px;
  height: 252px;
}

.polznav {
  padding: 10px 0px 0px 23px;
}

.end_number_rectangle {
  width: 455px;
  height: 251px;
  background: #FFFFFF;
  border: 4px solid #3F49A3;
  border-radius: 20px;
}

.end_number_txt {
  width: 419px;
  height: 64px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 32px;
  line-height: 39px;
  color: #3F49A3;
  padding: 25px 0px 0px 36px;
}

.Ucalss {
  height: 78px;
  font-family: 'IBM Plex Sans';
  font-style: normal;
  font-weight: 700;
  font-size: 48px;
  line-height: 78px;
  color: #000000;
}

.results_navigation {
  padding: 13px 0px 0px 36px;
}

.range_txt {
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 700;
  font-size: 32px;
  line-height: 39px;
  color: #ffffff;
  padding: 39px 0px 0px 20px;
}

.warring {
  background-image: url(static/warring_img.png);
  width: 754px;
  height: 181px;
}

.lab_list li {
  float: left;
}

.lab_list {
  height: 300px;
}

.warring_txt {
  width: 704px;
  height: 149px;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 600;
  font-size: 24px;
  line-height: 29px;
  color: #E2574C;
  padding: 33px 0px 0px 203px;
}

.btn_AllOborud {
  width: 228px;
  height: 114px;
  background: #FFFFFF;
  border: 4px solid #3F49A3;
  font-family: 'Montserrat';
  font-style: normal;
  font-weight: 600;
  font-size: 24px;
  line-height: 29px;
  text-align: center;
  color: #3F49A3;
  border-radius: 20px;
}

.navigation_lab {
  padding: 0px 40px 0px 0px;
}

.navigation_lab_two {
  padding: 0px 38px 0px 0px;
}
@media (min-width: 300px) and (max-width: 320px) {
  * {
    margin: 0px;
    padding: 0px;
  }

  .footer_rectangle {
    width: 320px;
    height: 86px;
    background: #393939;
  }

  .all_padding {
    padding: 0px 0px 0px 15px;
  }

  .all_padding_two {
    padding: 0px 0px 0px 20px;
  }

  .backround-app-site {
    background-image: url(static/AdobeStock_4373633.png);
    width: 320px;
    height: 150px;
  }

  .list_header li {
    float: left;
  }

  .header_navigation {
    padding: 2px 0px 0px 33px;
  }

  ul li {
    list-style: none;
  }

  .list_header {
    height: 25px;
  }

  .logo {
    width: 70px;
    height: 20px;
    padding: 5px 40px 0px 0px;
  }

  .list li {
    float: left;
  }

  .header-txt {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .header_txt_two {
    width: 123px;
    height: 39px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #FFFFFF;
    padding: 24px 0px 0px 0px;
  }

  .header-txt-on {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .animation_navigation {
    padding: 0px 48px 0px 0px;
  }

  .animation_cube {
    border-radius: 500px;
    padding: 0px 0px 0px 0px;
    width: 100px;
    height: 100px;
  }

  /**/

  .cont_txt {
    width: 210px;
    height: 50px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 22px 0px 0px 80px;
  }

  .student_one_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #333399 0%, #0D92CB 98.49%);
    border-radius: 10px;
  }

  .student_two_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #E98F0A 0%, #A44153 98.49%);  
    border-radius: 10px;
  }

  .student_three_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #8F00FF 0%, #0500FF 98.49%);
    border-radius: 10px;
  }

  .navigation_person_rectangle {
    padding: 0px 10px 0px 10px;
  }

  .name_person {
    width: 79px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 7px;
  }

  .work_person {
    width: 81px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 11px 0px 0px 4px;
  }

  .name_person_three {
    width: 86px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 1px;
  }

  .student_img {
    width: 80px;
    height: 89px;
    padding: 19px 0px 0px 10px;
  }

  .cont_two_txt {
    width: 46px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .laws_rectangle {
    width: 280px;
    height: 30px;
    background: #393939;
    border-radius: 5px;
  }

  .laws_list li {
    float: left;
  }

  .laws_name_txt {
    width: 250px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
    padding: 9px 0px 0px 15px;
  }

  .arrow_img {
    width: 12px;
    height: 9px;
    padding: 0px 2px 3px 1px;
  }

  .laws_btn {
    width: 15px;
    height: 15px;
    background: #FFFFFF;
    border-radius: 2px;
  }

  .navigation_btn_laws {
    padding: 7px 0px 0px 0px;
  }

  .navigation_laws_one {
    padding: 15px 0px 0px 0px;
  }

  .navigation_laws_two {
    padding: 10px 0px 10px 0px;
  }

  .theory_txt {
    width: 44px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .theory_rectangle {
    background-image: url(static/Rectangle153.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_two {
    background-image: url(static/Rectangle152.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_three {
    background-image: url(static/Rectangle151.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_four {
    background-image: url(static/Rectangle15.png);
    width: 135px;
    height: 64px;
  }

  .navigation_theory {
    padding: 0px 10px 0px 0px;
  }

  .navigation_theory_two {
    height: 85px;
  }

  .theoty_txt_two {
    width: 114px;
    height: 49px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
    padding: 0px 0px 0px 21px;
  }

  .laboratory_rectangle {
    width: 280px;
    height: 88px;
    background: #393939;
    border-radius: 8px;
  }

  .laboratory_txt {
    width: 208px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 0px 0px 0px 72px;
  }

  .navigation_laboratory {
    padding: 25px 0px 0px 0px;
  }

  .laboratory_name {
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
  }

  .laboratory_target_name {
    width: 239px;
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    padding: 10px 0px 0px 0px;
  }

  .navigation_all_txt_laboratory_rectangle {
    padding: 8px 0px 0px 8px;
  }

  .navigation_rectangle_laboratory {
    padding: 16px 0px 10px 0px;
  }

  .navigation_footer {
    padding: 25px 0px 0px 0px;
  }


  .footer_list li{
    float: left;
  }

  .footer_txt {
    width: 184px;
    height: 10px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 8px;
    line-height: 10px;
    color: #8C8C8C;
  }

  a {
    text-decoration: none;
  }

  .navigation_github{
    padding: 0px 0px 0px 76px;
  }

  .footer_list {
    padding: 22px 0px 0px 20px;
  }

  .github {
    width: 20px;
    height: 20px;
  }

  .nav_txt_footer {
    padding: 5px 0px 5px 0px;
  }

  .laws_txt_vueblock {
    width: 256px;
    height: 94px;
    background: #FFFFFF;
    border-width: 0px 2px 2px 2px;
    border-style: solid;
    border-color: #393939;
    border-radius: 0px 0px 5px 5px;
  }

  .navigation_laws_txt_vueblock {
    padding: 0px 0px 0px 12px;
  }

  .lawstxt {
    width: 216px;
    height: 57px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 9px;
    line-height: 11px;
    text-align: center;
    color: #3F49A3;
    padding: 14px 0px 0px 20px;
  }

  .lawstxt_two {
    width: 256px;
    height: 78px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 20px;
    line-height: 24px;
    text-align: center;
    color: #A33F8D;
  }

  .new_theory_txt {
    width: 260px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
  }

  .all_theory_txt {
    width: 290px;
    padding: 0px 0px 40px 0px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    letter-spacing: -0.03em;
    color: #393939;
  }

  .all_theory_navigation {
    width: 300px;
    padding: 25px 0px 50px 0px;
  } 

  .all_theory_img {
    width: 30px;
    height: 30px;
  }

  .reostat {
    background-image: url(static/reosatt.png);
    width: 145px;
    height: 80px;
  }

  .polznav {
    padding: 0px 0px 0px 6px;
  }

  .end_number_rectangle {
    width: 131px;
    height: 80px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 9px;
  }

  .end_number_txt {
    width: 126px;
    height: 20px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #3F49A3;
    padding: 8px 0px 0px 6px;
  }

  .Ucalss {
    height: 24px;
    font-family: 'Monda';
    font-style: normal;
    font-weight: 700;
    font-size: 15px;
    line-height: 24px;
    color: #000000;
  }

  .results_navigation {
    padding: 5px 0px 0px 15px;
  }

  .range_txt {
    width: 120px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #ffffff;
    padding: 4px 0px 0px 10px;
  }

  .warring {
    background-image: url(static/warring_two.png);
    width: 201px;
    height: 77px;
  }

  .lab_list li {
    float: left;
  }

  .slider::-webkit-slider-thumb {
    -webkit-appearance: none; 
    appearance: none;
    border-radius: 12px;
    width: 10px; 
    height: 20px; 
    background: #3F49A3; 
    cursor: pointer; 
  }

  .slider {
    -webkit-appearance: none;  
    appearance: none;
    width: 132px;
    height: 8px; 
    outline: none; 
    opacity: 1; 
    -webkit-transition: .2s; 
    transition: opacity .2s;
  }

  .lab_list {
    height: 90px;
  }

  .warring_txt {
    width: 193px;
    height: 55px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 9px;
    line-height: 11px;
    color: #E2574C;
    padding: 11px 0px 0px 65px;
  }

  .btn_AllOborud {
    width: 75px;
    height: 77px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 5px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #3F49A3;
  }

  .navigation_lab {
    padding: 0px 14px 0px 0px;
  }

  .navigation_lab_two {
    padding: 0px 14px 0px 0px;
  }
}

@media (min-width: 321px) and (max-width: 350px) {
  * {
    margin: 0px;
    padding: 0px;
  }

  .all_padding {
    padding: 0px 0px 0px 30px;
  }

  .footer_rectangle {
    width: 350px;
    height: 86px;
    background: #393939;
  }

  .footer_list {
    padding: 22px 0px 0px 35px;
  }

  .all_padding_two {
    padding: 0px 0px 0px 35px;
  }

  .backround-app-site {
    background-image: url(static/bakround350px.png);
    width: 350px;
    height: 150px;
  }

  .list_header li {
    float: left;
  }

  .header_navigation {
    padding: 2px 0px 0px 33px;
  }

  ul li {
    list-style: none;
  }

  .list_header {
    height: 25px;
  }

  .logo {
    width: 70px;
    height: 20px;
    padding: 5px 40px 0px 0px;
  }

  .list li {
    float: left;
  }

  .header-txt {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .header_txt_two {
    width: 123px;
    height: 39px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #FFFFFF;
    padding: 24px 0px 0px 0px;
  }

  .header-txt-on {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .animation_navigation {
    padding: 0px 54px 0px 0px;
  }

  .animation_cube {
    border-radius: 500px;
    padding: 0px 0px 0px 0px;
    width: 100px;
    height: 100px;
  }

  /**/

  .cont_txt {
    width: 210px;
    height: 50px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 22px 0px 0px 80px;
  }

  .student_one_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #333399 0%, #0D92CB 98.49%);
    border-radius: 10px;
  }

  .student_two_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #E98F0A 0%, #A44153 98.49%);  
    border-radius: 10px;
  }

  .student_three_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #8F00FF 0%, #0500FF 98.49%);
    border-radius: 10px;
  }

  .navigation_person_rectangle {
    padding: 0px 10px 0px 10px;
  }

  .name_person {
    width: 79px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 7px;
  }

  .work_person {
    width: 81px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 11px 0px 0px 4px;
  }

  .name_person_three {
    width: 86px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 1px;
  }

  .student_img {
    width: 80px;
    height: 89px;
    padding: 19px 0px 0px 10px;
  }

  .cont_two_txt {
    width: 46px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .laws_rectangle {
    width: 280px;
    height: 30px;
    background: #393939;
    border-radius: 5px;
  }

  .laws_list li {
    float: left;
  }

  .laws_name_txt {
    width: 250px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
    padding: 9px 0px 0px 15px;
  }

  .arrow_img {
    width: 12px;
    height: 9px;
    padding: 0px 2px 3px 1px;
  }

  .laws_btn {
    width: 15px;
    height: 15px;
    background: #FFFFFF;
    border-radius: 2px;
  }

  .navigation_btn_laws {
    padding: 7px 0px 0px 0px;
  }

  .navigation_laws_one {
    padding: 15px 0px 0px 0px;
  }

  .navigation_laws_two {
    padding: 10px 0px 10px 0px;
  }

  .theory_txt {
    width: 44px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .theory_rectangle {
    background-image: url(static/Rectangle153.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_two {
    background-image: url(static/Rectangle152.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_three {
    background-image: url(static/Rectangle151.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_four {
    background-image: url(static/Rectangle15.png);
    width: 135px;
    height: 64px;
  }

  .navigation_theory {
    padding: 0px 10px 0px 0px;
  }

  .navigation_theory_two {
    height: 85px;
  }

  .theoty_txt_two {
    width: 114px;
    height: 49px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
    padding: 0px 0px 0px 21px;
  }

  .laboratory_rectangle {
    width: 280px;
    height: 88px;
    background: #393939;
    border-radius: 8px;
  }

  .laboratory_txt {
    width: 208px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 0px 0px 0px 72px;
  }

  .navigation_laboratory {
    padding: 25px 0px 0px 0px;
  }

  .laboratory_name {
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
  }

  .laboratory_target_name {
    width: 239px;
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    padding: 10px 0px 0px 0px;
  }

  .navigation_all_txt_laboratory_rectangle {
    padding: 8px 0px 0px 8px;
  }

  .navigation_rectangle_laboratory {
    padding: 16px 0px 10px 0px;
  }

  .navigation_footer {
    padding: 25px 0px 0px 0px;
  }


  .footer_list li{
    float: left;
  }

  .footer_txt {
    width: 184px;
    height: 10px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 8px;
    line-height: 10px;
    color: #8C8C8C;
  }

  a {
    text-decoration: none;
  }

  .navigation_github{
    padding: 0px 0px 0px 76px;
  }

  .github {
    width: 20px;
    height: 20px;
  }

  .nav_txt_footer {
    padding: 5px 0px 5px 0px;
  }

  .laws_txt_vueblock {
    width: 256px;
    height: 94px;
    background: #FFFFFF;
    border-width: 0px 2px 2px 2px;
    border-style: solid;
    border-color: #393939;
    border-radius: 0px 0px 5px 5px;
  }

  .navigation_laws_txt_vueblock {
    padding: 0px 0px 0px 12px;
  }

  .lawstxt {
    width: 216px;
    height: 57px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 9px;
    line-height: 11px;
    text-align: center;
    color: #3F49A3;
    padding: 14px 0px 0px 20px;
  }

  .lawstxt_two {
    width: 256px;
    height: 78px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 20px;
    line-height: 24px;
    text-align: center;
    color: #A33F8D;
  }

  .new_theory_txt {
    width: 260px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
  }

  .all_theory_txt {
    width: 290px;
    padding: 0px 0px 40px 0px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    letter-spacing: -0.03em;
    color: #393939;
  }

  .all_theory_navigation {
    width: 300px;
    padding: 25px 0px 50px 0px;
  } 

  .all_theory_img {
    width: 30px;
    height: 30px;
  }

  .reostat {
    background-image: url(static/reosatt.png);
    width: 145px;
    height: 80px;
  }

  .polznav {
    padding: 0px 0px 0px 6px;
  }

  .end_number_rectangle {
    width: 131px;
    height: 80px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 9px;
  }

  .end_number_txt {
    width: 126px;
    height: 20px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #3F49A3;
    padding: 8px 0px 0px 6px;
  }

  .Ucalss {
    height: 24px;
    font-family: 'Monda';
    font-style: normal;
    font-weight: 700;
    font-size: 15px;
    line-height: 24px;
    color: #000000;
  }

  .results_navigation {
    padding: 5px 0px 0px 15px;
  }

  .range_txt {
    width: 120px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #ffffff;
    padding: 4px 0px 0px 10px;
  }

  .warring {
    background-image: url(static/warring_two.png);
    width: 201px;
    height: 77px;
  }

  .lab_list li {
    float: left;
  }

  .slider::-webkit-slider-thumb {
    -webkit-appearance: none; 
    appearance: none;
    border-radius: 12px;
    width: 10px; 
    height: 20px; 
    background: #3F49A3; 
    cursor: pointer; 
  }

  .slider {
    -webkit-appearance: none;  
    appearance: none;
    width: 132px;
    height: 8px; 
    outline: none; 
    opacity: 1; 
    -webkit-transition: .2s; 
    transition: opacity .2s;
  }

  .lab_list {
    height: 90px;
  }

  .warring_txt {
    width: 193px;
    height: 55px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 9px;
    line-height: 11px;
    color: #E2574C;
    padding: 11px 0px 0px 65px;
  }

  .btn_AllOborud {
    width: 75px;
    height: 77px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 5px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #3F49A3;
  }

  .navigation_lab {
    padding: 0px 14px 0px 0px;
  }

  .navigation_lab_two {
    padding: 0px 14px 0px 0px;
  }
}

@media (min-width: 351px) and (max-width: 375px) {
  * {
    margin: 0px;
    padding: 0px;
  }

  .all_padding {
    padding: 0px 0px 0px 42px;
  }

  .footer_rectangle {
    width: 375px;
    height: 86px;
    background: #393939;
  }

  .footer_list {
    padding: 22px 0px 0px 47px;
  }

  .all_padding_two {
    padding: 0px 0px 0px 47px;
  }

  .backround-app-site {
    background-image: url(static/bakround375px.png);
    width: 375px;
    height: 150px;
  }

  .list_header li {
    float: left;
  }

  .header_navigation {
    padding: 2px 0px 0px 34px;
  }

  ul li {
    list-style: none;
  }

  .list_header {
    height: 25px;
  }

  .logo {
    width: 70px;
    height: 20px;
    padding: 5px 40px 0px 0px;
  }

  .list li {
    float: left;
  }

  .header-txt {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .header_txt_two {
    width: 123px;
    height: 39px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #FFFFFF;
    padding: 24px 0px 0px 0px;
  }

  .header-txt-on {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .animation_navigation {
    padding: 0px 48px 0px 0px;
  }

  .animation_cube {
    border-radius: 500px;
    padding: 0px 0px 0px 0px;
    width: 100px;
    height: 100px;
  }

  /**/

  .cont_txt {
    width: 210px;
    height: 50px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 22px 0px 0px 80px;
  }

  .student_one_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #333399 0%, #0D92CB 98.49%);
    border-radius: 10px;
  }

  .student_two_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #E98F0A 0%, #A44153 98.49%);  
    border-radius: 10px;
  }

  .student_three_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #8F00FF 0%, #0500FF 98.49%);
    border-radius: 10px;
  }

  .navigation_person_rectangle {
    padding: 0px 10px 0px 10px;
  }

  .name_person {
    width: 79px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 7px;
  }

  .work_person {
    width: 81px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 11px 0px 0px 4px;
  }

  .name_person_three {
    width: 86px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 1px;
  }

  .student_img {
    width: 80px;
    height: 89px;
    padding: 19px 0px 0px 10px;
  }

  .cont_two_txt {
    width: 46px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .laws_rectangle {
    width: 280px;
    height: 30px;
    background: #393939;
    border-radius: 5px;
  }

  .laws_list li {
    float: left;
  }

  .laws_name_txt {
    width: 250px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
    padding: 9px 0px 0px 15px;
  }

  .arrow_img {
    width: 12px;
    height: 9px;
    padding: 0px 2px 3px 1px;
  }

  .laws_btn {
    width: 15px;
    height: 15px;
    background: #FFFFFF;
    border-radius: 2px;
  }

  .navigation_btn_laws {
    padding: 7px 0px 0px 0px;
  }

  .navigation_laws_one {
    padding: 15px 0px 0px 0px;
  }

  .navigation_laws_two {
    padding: 10px 0px 10px 0px;
  }

  .theory_txt {
    width: 44px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .theory_rectangle {
    background-image: url(static/Rectangle153.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_two {
    background-image: url(static/Rectangle152.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_three {
    background-image: url(static/Rectangle151.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_four {
    background-image: url(static/Rectangle15.png);
    width: 135px;
    height: 64px;
  }

  .navigation_theory {
    padding: 0px 10px 0px 0px;
  }

  .navigation_theory_two {
    height: 85px;
  }

  .theoty_txt_two {
    width: 114px;
    height: 49px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
    padding: 0px 0px 0px 21px;
  }

  .laboratory_rectangle {
    width: 280px;
    height: 88px;
    background: #393939;
    border-radius: 8px;
  }

  .laboratory_txt {
    width: 208px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 0px 0px 0px 72px;
  }

  .navigation_laboratory {
    padding: 25px 0px 0px 0px;
  }

  .laboratory_name {
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
  }

  .laboratory_target_name {
    width: 239px;
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    padding: 10px 0px 0px 0px;
  }

  .navigation_all_txt_laboratory_rectangle {
    padding: 8px 0px 0px 8px;
  }

  .navigation_rectangle_laboratory {
    padding: 16px 0px 10px 0px;
  }

  .navigation_footer {
    padding: 25px 0px 0px 0px;
  }


  .footer_list li{
    float: left;
  }

  .footer_txt {
    width: 184px;
    height: 10px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 8px;
    line-height: 10px;
    color: #8C8C8C;
  }

  a {
    text-decoration: none;
  }

  .navigation_github{
    padding: 0px 0px 0px 76px;
  }

  .github {
    width: 20px;
    height: 20px;
  }

  .nav_txt_footer {
    padding: 5px 0px 5px 0px;
  }

  .laws_txt_vueblock {
    width: 256px;
    height: 94px;
    background: #FFFFFF;
    border-width: 0px 2px 2px 2px;
    border-style: solid;
    border-color: #393939;
    border-radius: 0px 0px 5px 5px;
  }

  .navigation_laws_txt_vueblock {
    padding: 0px 0px 0px 12px;
  }

  .lawstxt {
    width: 216px;
    height: 57px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 9px;
    line-height: 11px;
    text-align: center;
    color: #3F49A3;
    padding: 14px 0px 0px 20px;
  }

  .lawstxt_two {
    width: 256px;
    height: 78px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 20px;
    line-height: 24px;
    text-align: center;
    color: #A33F8D;
  }

  .new_theory_txt {
    width: 260px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
  }

  .all_theory_txt {
    width: 290px;
    padding: 0px 0px 40px 0px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    letter-spacing: -0.03em;
    color: #393939;
  }

  .all_theory_navigation {
    width: 300px;
    padding: 25px 0px 50px 0px;
  } 

  .all_theory_img {
    width: 30px;
    height: 30px;
  }

  .reostat {
    background-image: url(static/reosatt.png);
    width: 145px;
    height: 80px;
  }

  .polznav {
    padding: 0px 0px 0px 6px;
  }

  .end_number_rectangle {
    width: 131px;
    height: 80px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 9px;
  }

  .end_number_txt {
    width: 126px;
    height: 20px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #3F49A3;
    padding: 8px 0px 0px 6px;
  }

  .Ucalss {
    height: 24px;
    font-family: 'Monda';
    font-style: normal;
    font-weight: 700;
    font-size: 15px;
    line-height: 24px;
    color: #000000;
  }

  .results_navigation {
    padding: 5px 0px 0px 15px;
  }

  .range_txt {
    width: 120px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #ffffff;
    padding: 4px 0px 0px 10px;
  }

  .warring {
    background-image: url(static/warring_two.png);
    width: 201px;
    height: 77px;
  }

  .lab_list li {
    float: left;
  }

  .slider::-webkit-slider-thumb {
    -webkit-appearance: none; 
    appearance: none;
    border-radius: 12px;
    width: 10px; 
    height: 20px; 
    background: #3F49A3; 
    cursor: pointer; 
  }

  .slider {
    -webkit-appearance: none;  
    appearance: none;
    width: 132px;
    height: 8px; 
    outline: none; 
    opacity: 1; 
    -webkit-transition: .2s; 
    transition: opacity .2s;
  }

  .lab_list {
    height: 90px;
  }

  .warring_txt {
    width: 193px;
    height: 55px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 9px;
    line-height: 11px;
    color: #E2574C;
    padding: 11px 0px 0px 65px;
  }

  .btn_AllOborud {
    width: 75px;
    height: 77px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 5px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #3F49A3;
  }

  .navigation_lab {
    padding: 0px 14px 0px 0px;
  }

  .navigation_lab_two {
    padding: 0px 14px 0px 0px;
  }
}

@media (min-width: 376px) and (max-width: 400px) {
  * {
    margin: 0px;
    padding: 0px;
  }

  .all_padding {
    padding: 0px 0px 0px 55px;
  }

  .footer_rectangle {
    width: 400px;
    height: 86px;
    background: #393939;
  }

  .footer_list {
    padding: 22px 0px 0px 60px;
  }

  .all_padding_two {
    padding: 0px 0px 0px 60px;
  }

  .backround-app-site {
    background-image: url(static/bakround400px.png);
    width: 400px;
    height: 150px;
  }

  .list_header li {
    float: left;
  }

  .header_navigation {
    padding: 2px 0px 0px 33px;
  }

  ul li {
    list-style: none;
  }

  .list_header {
    height: 25px;
  }

  .logo {
    width: 70px;
    height: 20px;
    padding: 5px 40px 0px 0px;
  }

  .list li {
    float: left;
  }

  .header-txt {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .header_txt_two {
    width: 123px;
    height: 39px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #FFFFFF;
    padding: 24px 0px 0px 0px;
  }

  .header-txt-on {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .animation_navigation {
    padding: 0px 60px 0px 0px;
  }

  .animation_cube {
    border-radius: 500px;
    padding: 0px 0px 0px 0px;
    width: 100px;
    height: 100px;
  }

  /**/

  .cont_txt {
    width: 210px;
    height: 50px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 22px 0px 0px 80px;
  }

  .student_one_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #333399 0%, #0D92CB 98.49%);
    border-radius: 10px;
  }

  .student_two_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #E98F0A 0%, #A44153 98.49%);  
    border-radius: 10px;
  }

  .student_three_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #8F00FF 0%, #0500FF 98.49%);
    border-radius: 10px;
  }

  .navigation_person_rectangle {
    padding: 0px 10px 0px 10px;
  }

  .name_person {
    width: 79px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 7px;
  }

  .work_person {
    width: 81px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 11px 0px 0px 4px;
  }

  .name_person_three {
    width: 86px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 1px;
  }

  .student_img {
    width: 80px;
    height: 89px;
    padding: 19px 0px 0px 10px;
  }

  .cont_two_txt {
    width: 46px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .laws_rectangle {
    width: 280px;
    height: 30px;
    background: #393939;
    border-radius: 5px;
  }

  .laws_list li {
    float: left;
  }

  .laws_name_txt {
    width: 250px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
    padding: 9px 0px 0px 15px;
  }

  .arrow_img {
    width: 12px;
    height: 9px;
    padding: 0px 2px 3px 1px;
  }

  .laws_btn {
    width: 15px;
    height: 15px;
    background: #FFFFFF;
    border-radius: 2px;
  }

  .navigation_btn_laws {
    padding: 7px 0px 0px 0px;
  }

  .navigation_laws_one {
    padding: 15px 0px 0px 0px;
  }

  .navigation_laws_two {
    padding: 10px 0px 10px 0px;
  }

  .theory_txt {
    width: 44px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .theory_rectangle {
    background-image: url(static/Rectangle153.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_two {
    background-image: url(static/Rectangle152.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_three {
    background-image: url(static/Rectangle151.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_four {
    background-image: url(static/Rectangle15.png);
    width: 135px;
    height: 64px;
  }

  .navigation_theory {
    padding: 0px 10px 0px 0px;
  }

  .navigation_theory_two {
    height: 85px;
  }

  .theoty_txt_two {
    width: 114px;
    height: 49px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
    padding: 0px 0px 0px 21px;
  }

  .laboratory_rectangle {
    width: 280px;
    height: 88px;
    background: #393939;
    border-radius: 8px;
  }

  .laboratory_txt {
    width: 208px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 0px 0px 0px 72px;
  }

  .navigation_laboratory {
    padding: 25px 0px 0px 0px;
  }

  .laboratory_name {
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
  }

  .laboratory_target_name {
    width: 239px;
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    padding: 10px 0px 0px 0px;
  }

  .navigation_all_txt_laboratory_rectangle {
    padding: 8px 0px 0px 8px;
  }

  .navigation_rectangle_laboratory {
    padding: 16px 0px 10px 0px;
  }

  .navigation_footer {
    padding: 25px 0px 0px 0px;
  }


  .footer_list li{
    float: left;
  }

  .footer_txt {
    width: 184px;
    height: 10px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 8px;
    line-height: 10px;
    color: #8C8C8C;
  }

  a {
    text-decoration: none;
  }

  .navigation_github{
    padding: 0px 0px 0px 76px;
  }

  .github {
    width: 20px;
    height: 20px;
  }

  .nav_txt_footer {
    padding: 5px 0px 5px 0px;
  }

  .laws_txt_vueblock {
    width: 256px;
    height: 94px;
    background: #FFFFFF;
    border-width: 0px 2px 2px 2px;
    border-style: solid;
    border-color: #393939;
    border-radius: 0px 0px 5px 5px;
  }

  .navigation_laws_txt_vueblock {
    padding: 0px 0px 0px 12px;
  }

  .lawstxt {
    width: 216px;
    height: 57px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 9px;
    line-height: 11px;
    text-align: center;
    color: #3F49A3;
    padding: 14px 0px 0px 20px;
  }

  .lawstxt_two {
    width: 256px;
    height: 78px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 20px;
    line-height: 24px;
    text-align: center;
    color: #A33F8D;
  }

  .new_theory_txt {
    width: 260px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
  }

  .all_theory_txt {
    width: 290px;
    padding: 0px 0px 40px 0px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    letter-spacing: -0.03em;
    color: #393939;
  }

  .all_theory_navigation {
    width: 300px;
    padding: 25px 0px 50px 0px;
  } 

  .all_theory_img {
    width: 30px;
    height: 30px;
  }

  .reostat {
    background-image: url(static/reosatt.png);
    width: 145px;
    height: 80px;
  }

  .polznav {
    padding: 0px 0px 0px 6px;
  }

  .end_number_rectangle {
    width: 131px;
    height: 80px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 9px;
  }

  .end_number_txt {
    width: 126px;
    height: 20px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #3F49A3;
    padding: 8px 0px 0px 6px;
  }

  .Ucalss {
    height: 24px;
    font-family: 'Monda';
    font-style: normal;
    font-weight: 700;
    font-size: 15px;
    line-height: 24px;
    color: #000000;
  }

  .results_navigation {
    padding: 5px 0px 0px 15px;
  }

  .range_txt {
    width: 120px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #ffffff;
    padding: 4px 0px 0px 10px;
  }

  .warring {
    background-image: url(static/warring_two.png);
    width: 201px;
    height: 77px;
  }

  .lab_list li {
    float: left;
  }

  .slider::-webkit-slider-thumb {
    -webkit-appearance: none; 
    appearance: none;
    border-radius: 12px;
    width: 10px; 
    height: 20px; 
    background: #3F49A3; 
    cursor: pointer; 
  }

  .slider {
    -webkit-appearance: none;  
    appearance: none;
    width: 132px;
    height: 8px; 
    outline: none; 
    opacity: 1; 
    -webkit-transition: .2s; 
    transition: opacity .2s;
  }

  .lab_list {
    height: 90px;
  }

  .warring_txt {
    width: 193px;
    height: 55px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 9px;
    line-height: 11px;
    color: #E2574C;
    padding: 11px 0px 0px 65px;
  }

  .btn_AllOborud {
    width: 75px;
    height: 77px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 5px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #3F49A3;
  }

  .navigation_lab {
    padding: 0px 14px 0px 0px;
  }

  .navigation_lab_two {
    padding: 0px 14px 0px 0px;
  }
}

@media (min-width: 401px) and (max-width: 425px) {
  * {
    margin: 0px;
    padding: 0px;
  }

  .all_padding {
    padding: 0px 0px 0px 67px;
  }

  .footer_rectangle {
    width: 425px;
    height: 86px;
    background: #393939;
  }

  .footer_list {
    padding: 22px 0px 0px 72px;
  }

  .all_padding_two {
    padding: 0px 0px 0px 72px;
  }

  .backround-app-site {
    background-image: url(static/Backround425px.png);
    width: 425px;
    height: 150px;
  }

  .list_header li {
    float: left;
  }

  .header_navigation {
    padding: 2px 0px 0px 34px;
  }

  ul li {
    list-style: none;
  }

  .list_header {
    height: 25px;
  }

  .logo {
    width: 70px;
    height: 20px;
    padding: 5px 40px 0px 0px;
  }

  .list li {
    float: left;
  }

  .header-txt {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .header_txt_two {
    width: 123px;
    height: 39px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #FFFFFF;
    padding: 24px 0px 0px 0px;
  }

  .header-txt-on {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .animation_navigation {
    padding: 0px 60px 0px 0px;
  }

  .animation_cube {
    border-radius: 500px;
    padding: 0px 0px 0px 0px;
    width: 100px;
    height: 100px;
  }

  /**/

  .cont_txt {
    width: 210px;
    height: 50px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 22px 0px 0px 80px;
  }

  .student_one_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #333399 0%, #0D92CB 98.49%);
    border-radius: 10px;
  }

  .student_two_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #E98F0A 0%, #A44153 98.49%);  
    border-radius: 10px;
  }

  .student_three_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #8F00FF 0%, #0500FF 98.49%);
    border-radius: 10px;
  }

  .navigation_person_rectangle {
    padding: 0px 10px 0px 10px;
  }

  .name_person {
    width: 79px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 7px;
  }

  .work_person {
    width: 81px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 11px 0px 0px 4px;
  }

  .name_person_three {
    width: 86px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 1px;
  }

  .student_img {
    width: 80px;
    height: 89px;
    padding: 19px 0px 0px 10px;
  }

  .cont_two_txt {
    width: 46px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .laws_rectangle {
    width: 280px;
    height: 30px;
    background: #393939;
    border-radius: 5px;
  }

  .laws_list li {
    float: left;
  }

  .laws_name_txt {
    width: 250px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
    padding: 9px 0px 0px 15px;
  }

  .arrow_img {
    width: 12px;
    height: 9px;
    padding: 0px 2px 3px 1px;
  }

  .laws_btn {
    width: 15px;
    height: 15px;
    background: #FFFFFF;
    border-radius: 2px;
  }

  .navigation_btn_laws {
    padding: 7px 0px 0px 0px;
  }

  .navigation_laws_one {
    padding: 15px 0px 0px 0px;
  }

  .navigation_laws_two {
    padding: 10px 0px 10px 0px;
  }

  .theory_txt {
    width: 44px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .theory_rectangle {
    background-image: url(static/Rectangle153.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_two {
    background-image: url(static/Rectangle152.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_three {
    background-image: url(static/Rectangle151.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_four {
    background-image: url(static/Rectangle15.png);
    width: 135px;
    height: 64px;
  }

  .navigation_theory {
    padding: 0px 10px 0px 0px;
  }

  .navigation_theory_two {
    height: 85px;
  }

  .theoty_txt_two {
    width: 114px;
    height: 49px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
    padding: 0px 0px 0px 21px;
  }

  .laboratory_rectangle {
    width: 280px;
    height: 88px;
    background: #393939;
    border-radius: 8px;
  }

  .laboratory_txt {
    width: 208px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 0px 0px 0px 72px;
  }

  .navigation_laboratory {
    padding: 25px 0px 0px 0px;
  }

  .laboratory_name {
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
  }

  .laboratory_target_name {
    width: 239px;
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    padding: 10px 0px 0px 0px;
  }

  .navigation_all_txt_laboratory_rectangle {
    padding: 8px 0px 0px 8px;
  }

  .navigation_rectangle_laboratory {
    padding: 16px 0px 10px 0px;
  }

  .navigation_footer {
    padding: 25px 0px 0px 0px;
  }


  .footer_list li{
    float: left;
  }

  .footer_txt {
    width: 184px;
    height: 10px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 8px;
    line-height: 10px;
    color: #8C8C8C;
  }

  a {
    text-decoration: none;
  }

  .navigation_github{
    padding: 0px 0px 0px 76px;
  }

  .github {
    width: 20px;
    height: 20px;
  }

  .nav_txt_footer {
    padding: 5px 0px 5px 0px;
  }

  .laws_txt_vueblock {
    width: 256px;
    height: 94px;
    background: #FFFFFF;
    border-width: 0px 2px 2px 2px;
    border-style: solid;
    border-color: #393939;
    border-radius: 0px 0px 5px 5px;
  }

  .navigation_laws_txt_vueblock {
    padding: 0px 0px 0px 12px;
  }

  .lawstxt {
    width: 216px;
    height: 57px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 9px;
    line-height: 11px;
    text-align: center;
    color: #3F49A3;
    padding: 14px 0px 0px 20px;
  }

  .lawstxt_two {
    width: 256px;
    height: 78px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 20px;
    line-height: 24px;
    text-align: center;
    color: #A33F8D;
  }

  .new_theory_txt {
    width: 260px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
  }

  .all_theory_txt {
    width: 290px;
    padding: 0px 0px 40px 0px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    letter-spacing: -0.03em;
    color: #393939;
  }

  .all_theory_navigation {
    width: 300px;
    padding: 25px 0px 50px 0px;
  } 

  .all_theory_img {
    width: 30px;
    height: 30px;
  }

  .reostat {
    background-image: url(static/reosatt.png);
    width: 145px;
    height: 80px;
  }

  .polznav {
    padding: 0px 0px 0px 6px;
  }

  .end_number_rectangle {
    width: 131px;
    height: 80px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 9px;
  }

  .end_number_txt {
    width: 126px;
    height: 20px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #3F49A3;
    padding: 8px 0px 0px 6px;
  }

  .Ucalss {
    height: 24px;
    font-family: 'Monda';
    font-style: normal;
    font-weight: 700;
    font-size: 15px;
    line-height: 24px;
    color: #000000;
  }

  .results_navigation {
    padding: 5px 0px 0px 15px;
  }

  .range_txt {
    width: 120px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #ffffff;
    padding: 4px 0px 0px 10px;
  }

  .warring {
    background-image: url(static/warring_two.png);
    width: 201px;
    height: 77px;
  }

  .lab_list li {
    float: left;
  }

  .slider::-webkit-slider-thumb {
    -webkit-appearance: none; 
    appearance: none;
    border-radius: 12px;
    width: 10px; 
    height: 20px; 
    background: #3F49A3; 
    cursor: pointer; 
  }

  .slider {
    -webkit-appearance: none;  
    appearance: none;
    width: 132px;
    height: 8px; 
    outline: none; 
    opacity: 1; 
    -webkit-transition: .2s; 
    transition: opacity .2s;
  }

  .lab_list {
    height: 90px;
  }

  .warring_txt {
    width: 193px;
    height: 55px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 9px;
    line-height: 11px;
    color: #E2574C;
    padding: 11px 0px 0px 65px;
  }

  .btn_AllOborud {
    width: 75px;
    height: 77px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 5px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #3F49A3;
  }

  .navigation_lab {
    padding: 0px 14px 0px 0px;
  }

  .navigation_lab_two {
    padding: 0px 14px 0px 0px;
  }
}

@media (min-width: 426px) and (max-width: 460px) {
  * {
    margin: 0px;
    padding: 0px;
  }

  .all_padding {
    padding: 0px 0px 0px 85px;
  }

  .footer_rectangle {
    width: 460px;
    height: 86px;
    background: #393939;
  }

  .footer_list {
    padding: 22px 0px 0px 90px;
  }

  .all_padding_two {
    padding: 0px 0px 0px 90px;
  }

  .backround-app-site {
    background-image: url(static/bakround460px.png);
    width: 460px;
    height: 150px;
  }

  .list_header li {
    float: left;
  }

  .header_navigation {
    padding: 2px 0px 0px 33px;
  }

  ul li {
    list-style: none;
  }

  .list_header {
    height: 25px;
  }

  .logo {
    width: 70px;
    height: 20px;
    padding: 5px 40px 0px 0px;
  }

  .list li {
    float: left;
  }

  .header-txt {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .header_txt_two {
    width: 123px;
    height: 39px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #FFFFFF;
    padding: 24px 0px 0px 0px;
  }

  .header-txt-on {
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 6px;
    line-height: 7px;
    color: #FFFFFF;
    padding: 0px 15px 0px 0px;
  }

  .animation_navigation {
    padding: 0px 72px 0px 0px;
  }

  .animation_cube {
    border-radius: 500px;
    padding: 0px 0px 0px 0px;
    width: 100px;
    height: 100px;
  }

  /**/

  .cont_txt {
    width: 210px;
    height: 50px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 22px 0px 0px 80px;
  }

  .student_one_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #333399 0%, #0D92CB 98.49%);
    border-radius: 10px;
  }

  .student_two_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #E98F0A 0%, #A44153 98.49%);  
    border-radius: 10px;
  }

  .student_three_rectangle {
    width: 90px;
    height: 178px;
    background: linear-gradient(21.44deg, #8F00FF 0%, #0500FF 98.49%);
    border-radius: 10px;
  }

  .navigation_person_rectangle {
    padding: 0px 10px 0px 10px;
  }

  .name_person {
    width: 79px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 7px;
  }

  .work_person {
    width: 81px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 11px 0px 0px 4px;
  }

  .name_person_three {
    width: 86px;
    height: 29px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 8px;
    line-height: 10px;
    text-align: center;
    color: #FFFFFF;
    padding: 9px 0px 0px 1px;
  }

  .student_img {
    width: 80px;
    height: 89px;
    padding: 19px 0px 0px 10px;
  }

  .cont_two_txt {
    width: 46px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .laws_rectangle {
    width: 280px;
    height: 30px;
    background: #393939;
    border-radius: 5px;
  }

  .laws_list li {
    float: left;
  }

  .laws_name_txt {
    width: 250px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
    padding: 9px 0px 0px 15px;
  }

  .arrow_img {
    width: 12px;
    height: 9px;
    padding: 0px 2px 3px 1px;
  }

  .laws_btn {
    width: 15px;
    height: 15px;
    background: #FFFFFF;
    border-radius: 2px;
  }

  .navigation_btn_laws {
    padding: 7px 0px 0px 0px;
  }

  .navigation_laws_one {
    padding: 15px 0px 0px 0px;
  }

  .navigation_laws_two {
    padding: 10px 0px 10px 0px;
  }

  .theory_txt {
    width: 44px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 25px 0px 15px 117px;
  }

  .theory_rectangle {
    background-image: url(static/Rectangle153.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_two {
    background-image: url(static/Rectangle152.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_three {
    background-image: url(static/Rectangle151.png);
    width: 135px;
    height: 64px;
  }

  .theory_rectangle_four {
    background-image: url(static/Rectangle15.png);
    width: 135px;
    height: 64px;
  }

  .navigation_theory {
    padding: 0px 10px 0px 0px;
  }

  .navigation_theory_two {
    height: 85px;
  }

  .theoty_txt_two {
    width: 114px;
    height: 49px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
    padding: 0px 0px 0px 21px;
  }

  .laboratory_rectangle {
    width: 280px;
    height: 88px;
    background: #393939;
    border-radius: 8px;
  }

  .laboratory_txt {
    width: 208px;
    height: 13px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 11px;
    line-height: 13px;
    color: #3F49A3;
    padding: 0px 0px 0px 72px;
  }

  .navigation_laboratory {
    padding: 25px 0px 0px 0px;
  }

  .laboratory_name {
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #FFFFFF;
  }

  .laboratory_target_name {
    width: 239px;
    height: 24px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    padding: 10px 0px 0px 0px;
  }

  .navigation_all_txt_laboratory_rectangle {
    padding: 8px 0px 0px 8px;
  }

  .navigation_rectangle_laboratory {
    padding: 16px 0px 10px 0px;
  }

  .navigation_footer {
    padding: 25px 0px 0px 0px;
  }


  .footer_list li{
    float: left;
  }

  .footer_txt {
    width: 184px;
    height: 10px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 8px;
    line-height: 10px;
    color: #8C8C8C;
  }

  a {
    text-decoration: none;
  }

  .navigation_github{
    padding: 0px 0px 0px 76px;
  }

  .github {
    width: 20px;
    height: 20px;
  }

  .nav_txt_footer {
    padding: 5px 0px 5px 0px;
  }

  .laws_txt_vueblock {
    width: 256px;
    height: 94px;
    background: #FFFFFF;
    border-width: 0px 2px 2px 2px;
    border-style: solid;
    border-color: #393939;
    border-radius: 0px 0px 5px 5px;
  }

  .navigation_laws_txt_vueblock {
    padding: 0px 0px 0px 12px;
  }

  .lawstxt {
    width: 216px;
    height: 57px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 9px;
    line-height: 11px;
    text-align: center;
    color: #3F49A3;
    padding: 14px 0px 0px 20px;
  }

  .lawstxt_two {
    width: 256px;
    height: 78px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 20px;
    line-height: 24px;
    text-align: center;
    color: #A33F8D;
  }

  .new_theory_txt {
    width: 260px;
    height: 30px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #393939;
  }

  .all_theory_txt {
    width: 290px;
    padding: 0px 0px 40px 0px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 500;
    font-size: 10px;
    line-height: 12px;
    letter-spacing: -0.03em;
    color: #393939;
  }

  .all_theory_navigation {
    width: 300px;
    padding: 25px 0px 50px 0px;
  } 

  .all_theory_img {
    width: 30px;
    height: 30px;
  }

  .reostat {
    background-image: url(static/reosatt.png);
    width: 145px;
    height: 80px;
  }

  .polznav {
    padding: 0px 0px 0px 6px;
  }

  .end_number_rectangle {
    width: 131px;
    height: 80px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 9px;
  }

  .end_number_txt {
    width: 126px;
    height: 20px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #3F49A3;
    padding: 8px 0px 0px 6px;
  }

  .Ucalss {
    height: 24px;
    font-family: 'Monda';
    font-style: normal;
    font-weight: 700;
    font-size: 15px;
    line-height: 24px;
    color: #000000;
  }

  .results_navigation {
    padding: 5px 0px 0px 15px;
  }

  .range_txt {
    width: 120px;
    height: 12px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 700;
    font-size: 10px;
    line-height: 12px;
    color: #ffffff;
    padding: 4px 0px 0px 10px;
  }

  .warring {
    background-image: url(static/warring_two.png);
    width: 201px;
    height: 77px;
  }

  .lab_list li {
    float: left;
  }

  .slider::-webkit-slider-thumb {
    -webkit-appearance: none; 
    appearance: none;
    border-radius: 12px;
    width: 10px; 
    height: 20px; 
    background: #3F49A3; 
    cursor: pointer; 
  }

  .slider {
    -webkit-appearance: none;  
    appearance: none;
    width: 132px;
    height: 8px; 
    outline: none; 
    opacity: 1; 
    -webkit-transition: .2s; 
    transition: opacity .2s;
  }

  .lab_list {
    height: 90px;
  }

  .warring_txt {
    width: 193px;
    height: 55px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 9px;
    line-height: 11px;
    color: #E2574C;
    padding: 11px 0px 0px 65px;
  }

  .btn_AllOborud {
    width: 75px;
    height: 77px;
    background: #FFFFFF;
    border: 2px solid #3F49A3;
    border-radius: 5px;
    font-family: 'Montserrat';
    font-style: normal;
    font-weight: 600;
    font-size: 10px;
    line-height: 12px;
    text-align: center;
    color: #3F49A3;
  }

  .navigation_lab {
    padding: 0px 14px 0px 0px;
  }

  .navigation_lab_two {
    padding: 0px 14px 0px 0px;
  }
}













































</style>